homework/hw1/1000mm/cylinder_Re/poiseuille_flow_axissymetric_distribution_3ms/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       78960;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       79000;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1000;
        startFace       79040;
    }
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          40000;
        startFace       80040;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          40000;
        startFace       120040;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       160040;
    }
)

// ************************************************************************* //
